---
type: MeshFromGeometryOperationResult
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# MeshFromGeometryOperationResult

`Autodesk.Revit.DB.MeshFromGeometryOperationResult` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetIssues | 2015 | `public IList < MeshFromGeometryOperationIssue > GetIssues ()` |
| Method | GetMesh | 2015 | `public Mesh GetMesh ()` |
| Property | HasInvalidData | 2015 | `public bool HasInvalidData { get ; }` |
| Property | IsMeshAvailable | 2015 | `public bool IsMeshAvailable { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Tessellated | 2015 | `public bool Tessellated { get ; }` |